stm32LLD/uart/src/uart.c
// Copyright (c) 2023 Ziga Miklosic
// All Rights Reserved
////////////////////////////////////////////////////////////////////////////////
/**
*@file      uart.c
*@brief     UART LL drivers based on STM32 HAL library
*@author    Ziga Miklosic
*@email     ziga.miklosic@gmail.si
*@date      21.04.2023
*@version   V0.1.0
*/
////////////////////////////////////////////////////////////////////////////////
/*!
* @addtogroup UART
* @{ <!-- BEGIN GROUP -->
*/
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Includes
////////////////////////////////////////////////////////////////////////////////
#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include <assert.h>

#include "uart.h"
#include "../../uart_cfg.h"

// Fifo
#include "middleware/ring_buffer/src/ring_buffer.h"

// Gpio
#include "drivers/peripheral/gpio/gpio/src/gpio.h"

////////////////////////////////////////////////////////////////////////////////
// Definitions
////////////////////////////////////////////////////////////////////////////////

/**
 *  Compatibility check with RING_BUFFER
 *
 *  Support version V2.x.x
 */
_Static_assert( 2 == RING_BUFFER_VER_MAJOR );

/**
 *  UART control
 */
typedef struct
{
    UART_HandleTypeDef  handle;         /**<UART handler */
    p_ring_buffer_t     tx_buf;         /**<Transmission buffer */
    p_ring_buffer_t     rx_buf;         /**<Reception buffer */
    bool                is_init;        /**<Initialization flag */
} uart_ctrl_t;

/**
 *  FIFO buffer attributes
 */
static const ring_buffer_attr_t g_buf_attr =
{
   .item_size   = sizeof( uint8_t ),    // Byte size
   .override    = false,                // Do not lost data
   .p_mem       = NULL,                 // Dynamically allocate
};

////////////////////////////////////////////////////////////////////////////////
// Variables
////////////////////////////////////////////////////////////////////////////////

/**
 *  UART control block
 */
static uart_ctrl_t g_uart[eUART_CH_NUM_OF] = {0};


////////////////////////////////////////////////////////////////////////////////
// Function prototypes
////////////////////////////////////////////////////////////////////////////////
static uart_status_t    uart_init_fifo      (const uart_ch_t uart_ch, const uint32_t tx_size, const uint32_t rx_size);
static void             uart_enable_clock   (const USART_TypeDef * p_inst);
static void             uart_disable_clock  (const USART_TypeDef * p_inst);
static void             uart_init_gpio      (const uart_pin_cfg_t * const p_pin_cfg);
static void             uart_deinit_gpio    (const uart_pin_cfg_t * const p_pin_cfg);
static inline bool      uart_find_channel   (const USART_TypeDef * p_inst, uart_ch_t * const p_ch);
static inline void      uart_process_isr    (const USART_TypeDef * p_inst);


////////////////////////////////////////////////////////////////////////////////
// Functions
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief    	Initialize UART FIFO buffers
*
* @param[in]	uart_ch     - UART communication channel
* @param[in]	tx_size     - Size of TX FIFO
* @param[in]	rx_size     - Size of RX FIFO
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
static uart_status_t uart_init_fifo(const uart_ch_t uart_ch, const uint32_t tx_size, const uint32_t rx_size)
{
    uart_status_t           status      = eUART_OK;
    ring_buffer_status_t    fifo_status = eRING_BUFFER_OK;

    // Init FIFO
    fifo_status |= ring_buffer_init( &g_uart[ uart_ch ].rx_buf, rx_size, &g_buf_attr );
    fifo_status |= ring_buffer_init( &g_uart[ uart_ch ].tx_buf, tx_size, &g_buf_attr );

    // Init Rx FIFO
    if ( eRING_BUFFER_OK != fifo_status )
    {
        status = eUART_ERROR;

        UART_ASSERT( 0 );
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Enable UART clock
*
* @param[in]    p_inst  - UART peripheral instance
* @return       status  - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
static void uart_enable_clock(const USART_TypeDef * p_inst)
{
#if defined(USART1)
	if ( USART1 == p_inst )
	{
		__HAL_RCC_USART1_CLK_ENABLE();
	}
#endif

#if defined(USART2)
	if ( USART2 == p_inst )
	{
		__HAL_RCC_USART2_CLK_ENABLE();
	}
#endif

#if defined(USART3)
	if ( USART3 == p_inst )
	{
		__HAL_RCC_USART3_CLK_ENABLE();
	}
#endif

#if defined(UART4)
    if ( UART4 == p_inst )
    {
        __HAL_RCC_UART4_CLK_ENABLE();
    }
#endif

#if defined(UART5)
    if ( UART5 == p_inst )
    {
        __HAL_RCC_UART5_CLK_ENABLE();
    }
#endif

#if defined(UART7)
    if ( UART7 == p_inst )
    {
        __HAL_RCC_UART7_CLK_ENABLE();
    }
#endif

#if defined(UART8)
    if ( UART8 == p_inst )
    {
        __HAL_RCC_UART8_CLK_ENABLE();
    }
#endif
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Disable UART clock
*
* @param[in]    p_inst  - UART peripheral instance
* @return       status  - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
static void uart_disable_clock(const USART_TypeDef * p_inst)
{
#if defined(USART1)
	if ( USART1 == p_inst )
	{
		__HAL_RCC_USART1_CLK_DISABLE();
	}
#endif

#if defined(USART2)
	if ( USART2 == p_inst )
	{
		__HAL_RCC_USART2_CLK_DISABLE();
	}
#endif

#if defined(USART3)
	if ( USART3 == p_inst )
	{
		__HAL_RCC_USART3_CLK_DISABLE();
	}
#endif

#if defined(UART4)
    if ( UART4 == p_inst )
    {
        __HAL_RCC_UART4_CLK_DISABLE();
    }
#endif

#if defined(UART5)
    if ( UART5 == p_inst )
    {
        __HAL_RCC_UART5_CLK_DISABLE();
    }
#endif

#if defined(UART7)
    if ( UART7 == p_inst )
    {
        __HAL_RCC_UART7_CLK_DISABLE();
    }
#endif

#if defined(UART8)
    if ( UART8 == p_inst )
    {
        __HAL_RCC_UART8_CLK_DISABLE();
    }
#endif
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Init UART pin
*
* @param[in]    p_pin_cfg   - Pointer to pin configuration
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
static void uart_init_gpio(const uart_pin_cfg_t * const p_pin_cfg)
{
    GPIO_InitTypeDef gpio_init = {0};

    // Enable clock
    gpio_enable_port_clock( p_pin_cfg->p_port );

    // Prepare gpio init structure
    gpio_init.Pin        = p_pin_cfg->pin;
    gpio_init.Mode       = GPIO_MODE_AF_PP;
    gpio_init.Speed      = GPIO_SPEED_FREQ_HIGH;
    gpio_init.Pull       = p_pin_cfg->pull;
    gpio_init.Alternate  = p_pin_cfg->af;

    // Init gpio
    HAL_GPIO_Init( p_pin_cfg->p_port, &gpio_init );
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        De-Init UART pin
*
* @param[in]    p_pin_cfg   - Pointer to pin configuration
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
static void uart_deinit_gpio(const uart_pin_cfg_t * const p_pin_cfg)
{
    // Init gpio
    HAL_GPIO_DeInit( p_pin_cfg->p_port, p_pin_cfg->pin );
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Find UART channel by hardware instance
*
* @param[in]    p_inst      - UART periphery (UART4, UART5,...)
* @param[out]   p_opt       - UART enumeration option
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
static inline bool uart_find_channel(const USART_TypeDef * p_inst, uart_ch_t * const p_ch)
{
    bool found = false;

