stm32LLD/uart/src/uart.c
    if ( size > 0U )
    {
        // Get current time
        const uint32_t now = UART_GET_SYSTICK();

        // Wait until all requested data are received
        while( rx_cnt < size )
        {
            // Check for timeout
            if (((uint32_t) ( UART_GET_SYSTICK() - now )) > timeout )
            {
                status = eUART_ERROR_TIMEOUT;
                break;
            }

            // Byte received?
            if ( eUART_OK == uart_receive_it( uart_ch, (uint8_t*) &p_data[rx_cnt] ))
            {
                // Byte received
                rx_cnt++;
            }
        }
    }
    else
    {
        status = eUART_ERROR;
    }

    return status;
}


////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Transmit data over UART
*
* @note     This function is non-blocking!
*
* @note     In case Tx FIFO gets full it returns "eUART_WAR_FULL".
*
* @note     Fractional messaging is prevented by checking size of TX fifo
*           before copy of transmit data takes place. Consequence of that
*           might be that message will not be transmitted as it currently
*           cannot be fitted into Tx FIFO.
*
* @note   When UART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
*         the sent data is handled as a set of u16. In this case, Size must indicate the number
*         of u16 provided through pData.
*
* @param[in]    uart_ch     - UART communication channel
* @param[in]    p_data      - Pointer to data to send
* @param[in]    size        - Size of data to send in bytes
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
uart_status_t uart_transmit_it(const uart_ch_t uart_ch, const uint8_t * const p_data, const uint32_t size)
{
    uart_status_t   status          = eUART_OK;
    uint32_t        buf_free_space  = 0U;
    uint32_t        _size           = size;

    UART_ASSERT( uart_ch < eUART_CH_NUM_OF );
    UART_ASSERT( true == g_uart[uart_ch].is_init );
    UART_ASSERT( NULL != p_data );
    UART_ASSERT( size <= UART_CFG_MTU );

    if ( uart_ch < eUART_CH_NUM_OF )
    {
        if  (   ( true == g_uart[uart_ch].is_init )
            &&  ( NULL != p_data )
            &&  ( size <= UART_CFG_MTU ))
        {
            // Two bytes in case of 9bit per transfer
            if ( UART_WORDLENGTH_9B == g_uart[uart_ch].handle.Init.WordLength )
            {
                _size = 2U * size;
            }

            // Check if there is space in Tx FIFO
            (void) ring_buffer_get_free( g_uart[uart_ch].tx_buf, &buf_free_space );

            // Enter critical
            __disable_irq();

            // There is space in Tx FIFO for complete message
            if ( _size <= buf_free_space )
            {
                // Put all data to Tx FIFO
                for ( uint32_t byte_idx = 0; byte_idx < _size; byte_idx++ )
                {
                    (void) ring_buffer_add( g_uart[uart_ch].tx_buf, (uint8_t*) &p_data[byte_idx] );
                }

                // Raise TX empty IRQ
                // NOTE: Later in irq message is being transmitted
                __HAL_UART_ENABLE_IT( &g_uart[uart_ch].handle, UART_IT_TXE );
            }

            // No space in Tx FIFO
            else
            {
                status = eUART_WAR_FULL;
            }

            // Exit critical
            __enable_irq();
        }
        else
        {
            status = eUART_ERROR;
        }
    }
    else
    {
        status = eUART_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Received data over UART
*
* @note     This function is non-blocking!
* @note     Function returns "eUART_WAR_EMPTY" when Rx FIFO is empty.
*
* @param[in]    uart_ch     - UART communication channel
* @param[out]   p_data      - Pointer to data to send
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
uart_status_t uart_receive_it(const uart_ch_t uart_ch, uint8_t * const p_data)
{
    uart_status_t           status      = eUART_OK;
    ring_buffer_status_t    buf_status  = eRING_BUFFER_OK;

    UART_ASSERT( uart_ch < eUART_CH_NUM_OF );
    UART_ASSERT( true == g_uart[uart_ch].is_init );
    UART_ASSERT( NULL != p_data );

    if ( uart_ch < eUART_CH_NUM_OF )
    {
        if  (   ( true == g_uart[uart_ch].is_init )
            &&  ( NULL != p_data ))
        {
            // Two bytes in case of 9bit per transfer
            if ( UART_WORDLENGTH_9B != g_uart[uart_ch].handle.Init.WordLength )
            {
                // Get data from RX FIFO
                if ( eRING_BUFFER_OK != ring_buffer_get( g_uart[uart_ch].rx_buf, (uint8_t*) p_data ))
                {
                    status = eUART_WAR_EMPTY;
                }
            }

            // 9bits per transfer
            else
            {
                buf_status =  ring_buffer_get( g_uart[uart_ch].rx_buf, (uint8_t*) p_data );
                buf_status |= ring_buffer_get( g_uart[uart_ch].rx_buf, (uint8_t*) ( p_data + 1U ));

                if ( eRING_BUFFER_OK != buf_status )
                {
                    status = eUART_WAR_EMPTY;
                }
            }
        }
        else
        {
            status = eUART_ERROR;
        }
    }
    else
    {
        status = eUART_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Clear all content in RX FIFO
*
* @param[in]    uart_ch     - UART communication channel
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
uart_status_t uart_clear_rx_buf(const uart_ch_t uart_ch)
{
    uart_status_t status = eUART_OK;

    UART_ASSERT( uart_ch < eUART_CH_NUM_OF );
    UART_ASSERT( true == g_uart[uart_ch].is_init );

    if ( uart_ch < eUART_CH_NUM_OF )
    {
        if ( true == g_uart[uart_ch].is_init )
        {
            // Reset/Clear RX FIFO
            if ( eRING_BUFFER_OK != ring_buffer_reset( g_uart[uart_ch].rx_buf ))
            {
                status = eUART_ERROR;
            }
        }
        else
        {
            status = eUART_ERROR;
        }
    }
    else
    {
        status = eUART_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Clear all content in TX FIFO
*
* @param[in]    uart_ch     - UART communication channel
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
uart_status_t uart_clear_tx_buf(const uart_ch_t uart_ch)
{
    uart_status_t status = eUART_OK;

    UART_ASSERT( uart_ch < eUART_CH_NUM_OF );
    UART_ASSERT( true == g_uart[uart_ch].is_init );

    if ( uart_ch < eUART_CH_NUM_OF )
    {
        if ( true == g_uart[uart_ch].is_init )
        {
            // Reset/Clear RX FIFO
            if ( eRING_BUFFER_OK != ring_buffer_reset( g_uart[uart_ch].tx_buf ))
            {
                status = eUART_ERROR;
            }
        }
        else
        {
            status = eUART_ERROR;
        }
    }
    else
    {
        status = eUART_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
* @} <!-- END GROUP -->
*/
////////////////////////////////////////////////////////////////////////////////
